app/controllers/admin_controller.rb

SELECT "users".* FROM "users"
---
    def getallemployees
        @users = User.all.select { |m| m.role == 'employee' }

SELECT COUNT(*) FROM "users" WHERE (role = 0)
SELECT COUNT(*) FROM "demandes"
---
    def countall
      @userscount = User.all.count
      @requestcount = Demande.all.count

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
    def deleteemployee
        @user = User.find(params[:user_id])
        @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2022-08-08 10:34:14.366019"], ["id", 3]]
---
    def updateimageadmin
        @user = User.find(params[:id])

        if @user.update(paramsimagefreelancer)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "lastname" = $2, "firstname" = $3, "adress" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["password_digest", "[FILTERED]"], ["lastname", "Med Amine "], ["firstname", "Mghirbi"], ["adress", "Kalla sghira"], ["updated_at", "2022-08-11 08:54:37.361412"], ["id", 1]]
---
    def updateadmin
        @user = User.find(params[:id])

        if @user.update(post_parasmadmin)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "lastname" = $2, "firstname" = $3, "adress" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["password_digest", "[FILTERED]"], ["lastname", "test"], ["firstname", "test"], ["adress", "test"], ["updated_at", "2022-08-08 11:05:57.797695"], ["id", 4]]
---
    def updateemployeebyadmin
      @user = User.find(params[:id])
      byebug
      if @user.update(post_paramsadminemployee)