app/controllers/demandes_controller.rb

SELECT "demandes".* FROM "demandes" ORDER BY "demandes"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
    def index

        render json: Demande.all.order(id: :ASC).paginate(:page => params[:page], :per_page => 10), include: [  :user, :motif   ]

INSERT INTO "demandes" ("start_date", "end_date", "status", "refus_reason", "created_at", "updated_at", "user_id", "motif_id", "days") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def create

        @demande = Demande.new(post_params)
        days= ((@demande.end_date.to_date - @demande.start_date.to_date).to_i)+1

        @demande.update_attribute(:days,days)
        if @demande.save

SELECT "demandes".* FROM "demandes" WHERE "demandes"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
      def show
        @demande = Demande.find(params[:id])

SELECT "demandes".* FROM "demandes" WHERE "demandes"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
UPDATE "demandes" SET "status" = $1, "refus_reason" = $2, "updated_at" = $3 WHERE "demandes"."id" = $4  [["status", 1], ["refus_reason", "non"], ["updated_at", "2022-08-15 13:40:46.643849"], ["id", 49]]
SELECT "demandes".* FROM "demandes" WHERE "demandes"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users"."nbr_days" FROM "users" WHERE (id = 2) LIMIT $1  [["LIMIT", 1]]
UPDATE "demandes" SET "status" = $1, "refus_reason" = $2, "updated_at" = $3 WHERE "demandes"."id" = $4  [["status", 2], ["refus_reason", "null"], ["updated_at", "2022-08-15 14:10:58.764275"], ["id", 50]]
UPDATE "users" SET "nbr_days" = $1 WHERE (id = 2)  [["nbr_days", 5.0]]
UPDATE "demandes" SET "status" = $1, "updated_at" = $2 WHERE "demandes"."id" = $3  [["status", 2], ["updated_at", "2022-08-14 12:14:11.747787"], ["id", 36]]
UPDATE "users" SET "nbr_days" = $1 WHERE (id = 7)  [["nbr_days", -10.0]]
---
      def update
        @demande = Demande.find(params[:id])

        if post_params2[:status] =="encours" || post_params2[:status] =="refused"
          @demande.update(post_params2)
          render json: @demande, include: [:user, :motif]
        elsif post_params2[:status] =="accepted"
          demande_days = (@demande.days).to_f
          @user = User.where("id = ?" ,  @demande.user_id )
          balance_days = @user.pluck(:nbr_days).join(',').to_f
          result = (balance_days-demande_days).to_f
          @demande.update(post_params2)
          @user.update_all(:nbr_days => result)

SELECT "demandes".* FROM "demandes" WHERE "demandes"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
DELETE FROM "demandes" WHERE "demandes"."id" = $1  [["id", 47]]
---
      def destroy
        @demande = Demande.find(params[:id])
        @demande.destroy

SELECT "demandes".* FROM "demandes" WHERE "demandes"."user_id" = $1  [["user_id", 2]]
---
      def getdemandebyemployee
        @demande = Demande.where(user_id: params[:user_id])

SELECT COUNT(*) FROM "demandes" WHERE (status = 2) AND "demandes"."user_id" = $1  [["user_id", 10]]
SELECT COUNT(*) FROM "demandes" WHERE (status = 1) AND "demandes"."user_id" = $1  [["user_id", 10]]
SELECT COUNT(*) FROM "demandes" WHERE (status = 0) AND "demandes"."user_id" = $1  [["user_id", 10]]
SELECT COUNT(*) FROM "demandes" WHERE "demandes"."user_id" = $1  [["user_id", 10]]
---
    def get_count_of_demandes_by_employee
      ids = []
      @accepteddemandes = Demande.where('status = ?', status = 2).where(user_id:  params[:user_id] ).count
      @refuseddemande = Demande.where('status = ?', status = 1).where(user_id:  params[:user_id] ).count
      @encoursdemande = Demande.where('status = ?', status = 0).where(user_id:  params[:user_id] ).count

      @allemployeedemande = Demande.where(user_id:  params[:user_id] ).count

SELECT "demandes".* FROM "demandes" WHERE "demandes"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
      def set_post
        @demande = Demande.find(params[:id])