app/controllers/motifs_controller.rb

    def index
        render json: Motif.all.order(id: :ASC)
---
SELECT "motifs".* FROM "motifs" ORDER BY "motifs"."id" ASC

      def create

        @motif = Motif.new(post_params)
        if @motif.save
---
INSERT INTO "motifs" ("reason", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["reason", "Congé maladie"], ["created_at", "2022-08-11 11:27:30.492595"], ["updated_at", "2022-08-11 11:27:30.492595"]]

      def update
        @motif = Motif.find(params[:id])
        if @motif.update(post_params2)
---
SELECT "motifs".* FROM "motifs" WHERE "motifs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "motifs" SET "reason" = $1, "updated_at" = $2 WHERE "motifs"."id" = $3  [["reason", "testttt"], ["updated_at", "2022-08-11 12:55:39.316931"], ["id", 3]]

      def destroy
        @motif = Motif.find(params[:id])
        @motif.destroy
---
SELECT "motifs".* FROM "motifs" WHERE "motifs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "motifs" WHERE "motifs"."id" = $1  [["id", 1]]

      def set_post
        @motif = Motif.find(params[:id])
---
SELECT "motifs".* FROM "motifs" WHERE "motifs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]