app/controllers/password_resets_controller.rb

    def update
      @user = User.find_by_password_reset_token!(params[:id])

      if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = $1 LIMIT $2  [["password_reset_token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2022-08-15 13:23:05.093194"], ["id", 7]]