app/controllers/registrations_controller.rb

  def confirm_email
    user = User.find_by_confirm_token(params[:id])
    if user
      user.email_confirmed = true
      user.confirm_token = nil
      user.save
---
SELECT "users".* FROM "users" WHERE "users"."confirm_token" = $1 LIMIT $2  [["confirm_token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "email_confirmed" = $2, "confirm_token" = $3 WHERE "users"."id" = $4  [["updated_at", "2022-08-06 00:58:14.798459"], ["email_confirmed", true], ["confirm_token", "[FILTERED]"], ["id", 1]]

  def create
    user = User.create!(
      email: params['user']['email'],
      password: params['user']['password'],
      password_confirmation: params['user']['password_confirmation'],
      role: params['user']['role'].to_i
    )
---
INSERT INTO "users" ("email", "password_digest", "lastname", "firstname", "adress", "role", "created_at", "updated_at", "email_confirmed", "confirm_token", "nbr_days", "password_reset_token", "password_reset_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"